Repository: Aptivi/Textify
Catalog: public/Textify/Resources/Languages/Output/Localizations.*.resx
Languages: ar, de, el, fr, ga, hi, hi_latn, id, it, ja, ko, nb, nl, pt, ro, uk, zh

# TEXTIFY_GENERAL_STRUCTURES_WCHAR_EXCEPTION_NOSTRING
source: String is not specified
ar: لم يتم تحديد السلسلة النصية.
de: Zeichenfolge ist nicht angegeben.
el: Δεν έχει καθοριστεί συμβολοσειρά
fr: Chaîne non spécifiée
ga: Níl teaghrán sonraithe
hi: स्ट्रिंग निर्दिष्ट नहीं है
hi_latn: string nirdisht nahin hai
id: String tidak ditentukan
it: Stringa non specificata
ja: 文字列が指定されていません
ko: 문자열이 지정되지 않았습니다.
nb: Streng er ikke spesifisert
nl: String is niet opgegeven
pt: String não especificada
ro: Șirul nu este specificat
uk: Рядок не вказано
zh: 未指定字串

# TEXTIFY_GENERAL_STRUCTURES_WCHAR_EXCEPTION_TWOCHARSMAX
source: Source string may not contain greater than two characters
ar: لا يجوز أن تحتوي السلسلة النصية المصدر على أكثر من حرفين.
de: Quellzeichenfolge darf nicht mehr als zwei Zeichen enthalten.
el: Η συμβολοσειρά πηγής δεν μπορεί να περιέχει περισσότερους από δύο χαρακτήρες
fr: La chaîne source ne doit pas contenir plus de deux caractères
ga: Ní fhéadfaidh níos mó ná dhá charachtar a bheith sa teaghrán foinse
hi: स्रोत स्ट्रिंग में दो से अधिक वर्ण नहीं हो सकते
hi_latn: srot string mein do se adhik varn nahin ho sakate
id: String sumber tidak boleh berisi lebih dari dua karakter
it: La stringa di origine non può contenere più di due caratteri
ja: ソース文字列は2文字以下でなければなりません
ko: 소스 문자열은 두 문자를 초과할 수 없습니다.
nb: Kildestrengen kan ikke inneholde mer enn to tegn
nl: Bronstring mag niet meer dan twee tekens bevatten
pt: A string de origem não pode conter mais de dois caracteres
ro: Șirul sursă nu poate conține mai mult de două caractere
uk: Вихідний рядок не може містити більше двох символів
zh: 來源字串不能包含超過兩個字符

# TEXTIFY_GENERAL_STRUCTURES_WCHAR_EXCEPTION_INVALIDCHAR
source: Invalid character. [High: {0}, Low: {1}]
ar: حرف غير صالح. [مرتفع: {0}، منخفض: {1}]
de: Ungültiges Zeichen. [Hoch: {0}, Niedrig: {1}]
el: Μη έγκυρος χαρακτήρας. [Υψηλή: {0}, Χαμηλή: {1}]
fr: Caractère non valide. [Élevé : {0}, Faible : {1}]
ga: Carachtar neamhbhailí. [Ard: {0}, Íseal: {1}]
hi: अमान्य वर्ण। [उच्च: {0}, निम्न: {1}]
hi_latn: amaany varn. [uchch: {0}, nimn: {1}]
id: Karakter tidak valid. [Tinggi: {0}, Rendah: {1}]
it: Carattere non valido. [Alto: {0}, Basso: {1}]
ja: 無効な文字です。[上限: {0}, 下限: {1}]
ko: 잘못된 문자입니다. [상위: {0}, 하위: {1}]
nb: Ugyldig tegn. [Høy: {0}, Lav: {1}]
nl: Ongeldig teken. [Hoog: {0}, Laag: {1}]
pt: Caracter inválido. [Alto: {0}, Baixo: {1}]
ro: Caracter nevalid. [Ridicat: {0}, Scăzut: {1}]
uk: Недійсний символ. [Високе значення: {0}, Низьке значення: {1}]
zh: 無效字元。 [最高位：{0}，最低位：{1}]

# TEXTIFY_GENERAL_EXCEPTION_TARGETISNULL
source: The target may not be null
ar: لا يجوز أن يكون الهدف فارغًا.
de: Ziel darf nicht null sein.
el: Ο στόχος μπορεί να μην είναι null
fr: La cible ne doit pas être nulle
ga: B'fhéidir nach bhfuil an sprioc nialasach
hi: लक्ष्य शून्य नहीं हो सकता
hi_latn: lakshy shoony nahin ho sakata
id: Target tidak boleh null
it: La destinazione non può essere null
ja: ターゲットはnullであってはなりません
ko: 대상은 null이 아니어야 합니다.
nb: Målet kan ikke være null
nl: Het doel mag niet nul zijn
pt: O destino não pode ser nulo
ro: Ținta poate să nu fie nulă
uk: Ціль може не бути null
zh: 目標不能為空

# TEXTIFY_GENERAL_EXCEPTION_SOURCEISNULL
source: The source may not be null
ar: لا يجوز أن يكون المصدر فارغًا.
de: Quelle darf nicht null sein.
el: Η πηγή μπορεί να μην είναι null
fr: La source ne doit pas être nulle
ga: B'fhéidir nach bhfuil an fhoinse nialasach
hi: स्रोत शून्य नहीं हो सकता
hi_latn: srot shoony nahin ho sakata
id: Sumber tidak boleh null
it: La sorgente non può essere null
ja: ソースはnullであってはなりません
ko: 소스는 null이 아니어야 합니다.
nb: Kilden kan ikke være null
nl: De bron mag niet nul zijn
pt: A origem não pode ser nula
ro: Sursa poate să nu fie nulă
uk: Джерело може не бути null
zh: 來源不能為空

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTTARGETSARENULL_TEXT
source: Array of to be replaced strings may not be null
ar: لا يجوز أن تكون مصفوفة السلاسل النصية المراد استبدالها فارغة.
de: Array der zu ersetzenden Zeichenfolgen darf nicht null sein.
el: Ο πίνακας συμβολοσειρών προς αντικατάσταση μπορεί να μην είναι null
fr: Le tableau de chaînes à remplacer ne doit pas être nul
ga: B'fhéidir nach bhfuil eagar na dtéaghrán atá le hathsholáthar nialasach
hi: प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी शून्य नहीं हो सकती
hi_latn: pratisthaapit kee jaane vaalee string kee saranee shoony nahin ho sakatee
id: Array string yang akan diganti tidak boleh null
it: L'array di stringhe da sostituire non può essere null
ja: 置換される文字列の配列はnullであってはなりません
ko: 바꿀 문자열 배열은 null이 아니어야 합니다.
nb: Matrise med strenger som skal erstattes kan ikke være null
nl: Array met te vervangen strings mag niet nul zijn
pt: A matriz de strings a substituir não pode ser nula
ro: Matricea de șiruri de înlocuit poate să nu fie nulă
uk: Масив рядків, що підлягають заміні, може не бути null
zh: 待替換字串的陣列不能為空

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTSOURCESARENULL_TEXT
source: Array of to be replacement strings may not be null
ar: لا يجوز أن تكون مصفوفة السلاسل النصية المراد استبدالها فارغة.
de: Array der zu ersetzenden Zeichenfolgen darf nicht null sein.
el: Ο πίνακας συμβολοσειρών αντικατάστασης μπορεί να μην είναι null
fr: Le tableau de chaînes à remplacer ne doit pas être nul
ga: B'fhéidir nach bhfuil eagar na dtéaghrán atá le hathsholáthar nialasach
hi: प्रतिस्थापन की जाने वाली स्ट्रिंग की सरणी शून्य नहीं हो सकती
hi_latn: pratisthaapan kee jaane vaalee string kee saranee shoony nahin ho sakatee
id: Array string yang akan diganti tidak boleh null
it: L'array di stringhe da sostituire non può essere null
ja: 置換される文字列の配列はnullであってはなりません
ko: 바꿀 문자열 배열은 null이 아니어야 합니다.
nb: Matrise med strenger som skal erstattes kan ikke være null
nl: Array met te vervangen strings mag niet nul zijn
pt: A matriz de strings a substituir não pode ser nula
ro: Matricea de șiruri de înlocuit poate să nu fie nulă
uk: Масив рядків, що підлягають заміні, може не бути null
zh: 待替換字串的陣列不能為空

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTARRAYLENGTHMISMATCH_TEXT_TEXT
source: Array length of which strings to be replaced doesn't equal the array length of which strings to replace.
ar: لا يُساوي طول المصفوفة التي سيتم استبدالها طول المصفوفة التي سيتم استبدالها.
de: Die Länge des Arrays der zu ersetzenden Zeichenfolgen entspricht nicht der Länge des Arrays der zu ersetzenden Zeichenfolgen.
el: Το μήκος του πίνακα των συμβολοσειρών που θα αντικατασταθούν δεν ισούται με το μήκος του πίνακα των συμβολοσειρών που θα αντικατασταθούν.
fr: La longueur du tableau des chaînes à remplacer n'est pas égale à celle du tableau des chaînes à remplacer.
ga: Ní ionann fad an eagar de na teaghráin atá le hathsholáthar agus fad an eagar de na teaghráin atá le hathsholáthar.
hi: प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी की लंबाई, प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी की लंबाई के बराबर नहीं है।
hi_latn: pratisthaapit kee jaane vaalee string kee saranee kee lambaee, pratisthaapit kee jaane vaalee string kee saranee kee lambaee ke baraabar nahin hai.
id: Panjang array string yang akan diganti tidak sama dengan panjang array string yang akan diganti.
it: La lunghezza dell'array delle stringhe da sostituire non è uguale alla lunghezza dell'array delle stringhe da sostituire.
ja: 置換される文字列の配列の長さが、置換される文字列の配列の長さと一致しません。
ko: 바꿀 문자열의 배열 길이가 바꿀 문자열의 배열 길이와 같지 않습니다.
nb: Matriselengden for strengene som skal erstattes er ikke lik matriselengden for strengene som skal erstattes.
nl: De arraylengte van de te vervangen strings is niet gelijk aan de arraylengte van de te vervangen strings.
pt: O comprimento da matriz de strings a substituir não é igual ao comprimento da matriz de strings a substituir.
ro: Lungimea matricei șirurilor de înlocuit nu este egală cu lungimea matricei șirurilor de înlocuit.
uk: Довжина масиву рядків, що підлягають заміні, не дорівнює довжині масиву рядків, що підлягають заміні.
zh: 待替換字串的陣列長度不等於待替換字串的陣列長度。

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTTARGETSARENULL_CHAR
source: Array of to be replaced characters may not be null
ar: لا يجوز أن تكون مصفوفة الأحرف المراد استبدالها فارغة.
de: Array der zu ersetzenden Zeichen darf nicht null sein.
el: Ο πίνακας χαρακτήρων που θα αντικατασταθούν μπορεί να μην είναι null
fr: Le tableau de caractères à remplacer ne doit pas être nul
ga: B'fhéidir nach bhfuil eagar na gcarachtar atá le hathsholáthar nialasach
hi: प्रतिस्थापित की जाने वाली वर्ण की सरणी शून्य नहीं हो सकती
hi_latn: pratisthaapit kee jaane vaalee varn kee saranee shoony nahin ho sakatee
id: Array karakter yang akan diganti tidak boleh null
it: L'array dei caratteri da sostituire non può essere null
ja: 置換される文字の配列はnullであってはなりません
ko: 바꿀 문자의 배열은 null이 아니어야 합니다.
nb: Matrise med tegn som skal erstattes kan ikke være null
nl: Array met te vervangen tekens mag niet nul zijn
pt: A matriz de caracteres a substituir não pode ser nula
ro: Matricea de caractere de înlocuit poate să nu fie nulă
uk: Масив символів, що підлягають заміні, може не бути null
zh: 待替換字元的陣列不能為空

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTSOURCESARENULL_CHAR
source: Array of to be replacement characters may not be null
ar: لا يجوز أن تكون مصفوفة الأحرف المراد استبدالها فارغة.
de: Array der zu ersetzenden Zeichen darf nicht null sein.
el: Ο πίνακας χαρακτήρων αντικατάστασης μπορεί να μην είναι null
fr: Le tableau de caractères à remplacer ne doit pas être nul
ga: B'fhéidir nach bhfuil eagar na gcarachtar atá le hathsholáthar nialasach
hi: प्रतिस्थापन की जाने वाली वर्ण की सरणी शून्य नहीं हो सकती
hi_latn: pratisthaapan kee jaane vaalee varn kee saranee shoony nahin ho sakatee
id: Array karakter yang akan diganti tidak boleh null
it: L'array dei caratteri da sostituire non può essere null
ja: 置換される文字列の配列の長さが、置換される文字の配列の長さと一致しません。
ko: 바꿀 문자의 배열은 null이 아니어야 합니다.
nb: Matrise med tegn som skal erstattes kan ikke være null
nl: Array met te vervangen tekens mag niet nul zijn
pt: A matriz de caracteres a substituir não pode ser nula
ro: Matricea de caractere de înlocuit poate să nu fie nulă
uk: Масив символів, що підлягають заміні, може не бути null
zh: 待替換字元的陣列不能為空

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTARRAYLENGTHMISMATCH_TEXT_CHAR
source: Array length of which strings to be replaced doesn't equal the array length of which characters to replace.
ar: لا يُساوي طول مصفوفة السلاسل النصية المراد استبدالها طول مصفوفة الأحرف المراد استبدالها.
de: Die Länge des Arrays der zu ersetzenden Zeichenfolgen entspricht nicht der Länge des Arrays der zu ersetzenden Zeichen.
el: Το μήκος του πίνακα των συμβολοσειρών που θα αντικατασταθούν δεν ισούται με το μήκος του πίνακα των χαρακτήρων που θα αντικατασταθούν.
fr: La longueur du tableau des chaînes à remplacer n'est pas égale à celle du tableau des caractères à remplacer.
ga: Ní ionann fad an eagar de na teaghráin atá le hathsholáthar agus fad an eagar de na carachtair atá le hathsholáthar.
hi: प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी की लंबाई, प्रतिस्थापित की जाने वाली वर्ण की सरणी की लंबाई के बराबर नहीं है।
hi_latn: pratisthaapit kee jaane vaalee string kee saranee kee lambaee, pratisthaapit kee jaane vaalee varn kee saranee kee lambaee ke baraabar nahin hai.
id: Panjang array string yang akan diganti tidak sama dengan panjang array karakter yang akan diganti.
it: La lunghezza dell'array delle stringhe da sostituire non è uguale alla lunghezza dell'array dei caratteri da sostituire.
ja: 置換される文字の配列の長さが、置換される文字列の配列の長さと一致しません。
ko: 바꿀 문자열의 배열 길이가 바꿀 문자열의 배열 길이와 같지 않습니다.
nb: Matriselengden for strengene som skal erstattes er ikke lik matriselengden for tegnene som skal erstattes.
nl: De arraylengte van de te vervangen strings is niet gelijk aan de arraylengte van de te vervangen tekens.
pt: O comprimento da matriz de strings a substituir não é igual ao comprimento da matriz de caracteres a substituir.
ro: Lungimea matricei șirurilor de înlocuit nu este egală cu lungimea matricei caracterelor de înlocuit.
uk: Довжина масиву рядків, що підлягають заміні, не дорівнює довжині масиву символів, що підлягають заміні.
zh: 待替換字串的陣列長度不等於待替換字元的陣列長度。

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTARRAYLENGTHMISMATCH_CHAR_TEXT
source: Array length of which characters to be replaced doesn't equal the array length of which strings to replace.
ar: لا يُساوي طول مصفوفة الأحرف المراد استبدالها طول مصفوفة السلاسل النصية المراد استبدالها.
de: Die Länge des Arrays der zu ersetzenden Zeichen entspricht nicht der Länge des Arrays der zu ersetzenden Zeichenfolgen.
el: Το μήκος του πίνακα των χαρακτήρων που θα αντικατασταθούν δεν ισούται με το μήκος του πίνακα των συμβολοσειρών που θα αντικατασταθούν.
fr: La longueur du tableau des caractères à remplacer n'est pas égale à celle du tableau des chaînes à remplacer.
ga: Ní ionann fad an eagar de na carachtair atá le hathsholáthar agus fad an eagar de na teaghráin atá le hathsholáthar.
hi: प्रतिस्थापित की जाने वाली वर्ण की सरणी की लंबाई, प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी की लंबाई के बराबर नहीं है।
hi_latn: pratisthaapit kee jaane vaalee varn kee saranee kee lambaee, pratisthaapit kee jaane vaalee string kee saranee kee lambaee ke baraabar nahin hai.
id: Panjang array karakter yang akan diganti tidak sama dengan panjang array string yang akan diganti.
it: La lunghezza dell'array dei caratteri da sostituire non è uguale alla lunghezza dell'array delle stringhe da sostituire.
ja: 置換される文字の配列の長さが、置換される文字列の配列の長さと一致しません。
ko: 바꿀 문자의 배열 길이가 바꿀 문자의 배열 길이와 같지 않습니다.
nb: Matriselengden for tegnene som skal erstattes er ikke lik matriselengden for strengene som skal erstattes.
nl: Arraylengte van de te vervangen tekens is niet gelijk aan de arraylengte van de te vervangen strings.
pt: O comprimento da matriz de caracteres a substituir não é igual ao comprimento da matriz de strings a substituir.
ro: Lungimea matricei caracterelor de înlocuit nu este egală cu lungimea matricei șirurilor de înlocuit.
uk: Довжина масиву символів, що підлягають заміні, не дорівнює довжині масиву рядків, що підлягають заміні.
zh: 待替換字元的陣列長度不等於待替換字串的陣列長度。

# TEXTIFY_GENERAL_EXCEPTION_REPLACEMENTARRAYLENGTHMISMATCH_CHAR_CHAR
source: Array length of which characters to be replaced doesn't equal the array length of which characters to replace.
ar: لا يُساوي طول مصفوفة الأحرف المراد استبدالها طول مصفوفة الأحرف المراد استبدالها.
de: Die Länge des Arrays der zu ersetzenden Zeichen entspricht nicht der Länge des Arrays der zu ersetzenden Zeichen.
el: Το μήκος του πίνακα των χαρακτήρων που θα αντικατασταθούν δεν ισούται με το μήκος του πίνακα των χαρακτήρων που θα αντικατασταθούν.
fr: La longueur du tableau des caractères à remplacer n'est pas égale à celle du tableau des caractères à remplacer.
ga: Ní ionann fad an eagar de na carachtair atá le hathsholáthar agus fad an eagar de na carachtair atá le hathsholáthar.
hi: प्रतिस्थापित की जाने वाली वर्ण की सरणी की लंबाई, प्रतिस्थापित की जाने वाली स्ट्रिंग की सरणी की लंबाई के बराबर नहीं है।
hi_latn: pratisthaapit kee jaane vaalee varn kee saranee kee lambaee, pratisthaapit kee jaane vaalee string kee saranee kee lambaee ke baraabar nahin hai.
id: Panjang array karakter yang akan diganti tidak sama dengan panjang array karakter yang akan diganti.
it: La lunghezza dell'array dei caratteri da sostituire non è uguale alla lunghezza dell'array dei caratteri da sostituire.
ja: 置換される文字の配列の長さが、置換される文字の配列の長さと一致しません。
ko: 바꿀 문자의 배열 길이가 바꿀 문자의 배열 길이와 같지 않습니다.
nb: Matriselengden for tegnene som skal erstattes er ikke lik matriselengden for tegnene som skal erstattes.
nl: Arraylengte van de te vervangen tekens is niet gelijk aan de arraylengte van de te vervangen tekens.
pt: O comprimento da matriz de caracteres a substituir não é igual ao comprimento da matriz de caracteres a substituir.
ro: Lungimea matricei caracterelor de înlocuit nu este egală cu lungimea matricei caracterelor de înlocuit.
uk: Довжина масиву символів, що підлягають заміні, не дорівнює довжині масиву символів, що підлягають заміні.
zh: 待替換字元的陣列長度不等於待替換字元的陣列長度。

# TEXTIFY_GENERAL_EXCEPTION_SEARCHTEXTISNULL
source: The search text may not be null
ar: لا يجوز أن يكون نص البحث فارغًا.
de: Der Suchtext darf nicht null sein.
el: Το κείμενο αναζήτησης ενδέχεται να μην είναι null
fr: Le texte recherché n'est peut-être pas nul.
ga: B’fhéidir nach bhfuil an téacs cuardaigh nialasach
hi: प्रतिस्थापित की जाने वाली वर्ण की सरणी की लंबाई, प्रतिस्थापित की जाने वाली वर्ण ... खोज पाठ शून्य नहीं हो सकता
hi_latn: pratisthaapit kee jaane vaalee varn kee saranee kee lambaee, pratisthaapit kee jaane vaalee varn ... khoj paath shoony nahin ho sakata
id: Teks pencarian mungkin tidak null
it: Il testo di ricerca non può essere nullo
ja: 検索テキストは null であってはなりません。
ko: 검색 텍스트가 null일 수 없습니다.
nb: Søketeksten kan ikke være null
nl: De zoektekst mag niet nul zijn
pt: O texto da pesquisa não pode ser nulo
ro: Textul căutat poate să nu fie nul
uk: Пошуковий текст може бути не нульовим
zh: 搜尋文字不能為空

# TEXTIFY_GENERAL_EXCEPTION_STRINGVALUEISNULL
source: Empty string value specified
ar: تم تحديد قيمة سلسلة نصية فارغة.
de: Leerer Stringwert angegeben.
el: Καθορίστηκε κενή τιμή συμβολοσειράς
fr: Valeur de chaîne vide spécifiée.
ga: Luach teaghrán folamh sonraithe
hi: खाली स्ट्रिंग मान निर्दिष्ट किया गया
hi_latn: khaalee string maan nirdisht kiya gaya
id: Nilai string kosong ditentukan
it: È stato specificato un valore stringa vuoto
ja: 空の文字列値が指定されています。
ko: 빈 문자열 값이 지정되었습니다.
nb: Tom strengverdi spesifisert
nl: Lege tekenreekswaarde opgegeven
pt: Valor de string vazio especificado
ro: Valoare șir goală specificată
uk: Вказано порожнє значення рядка
zh: 指定了空字串值

# TEXTIFY_GENERAL_EXCEPTION_TARGETFORMATISNULL
source: The target format may not be null
ar: لا يجوز أن يكون تنسيق الهدف فارغًا.
de: Das Zielformat darf nicht null sein.
el: Η μορφή στόχου ενδέχεται να μην είναι null
fr: Le format cible n'est peut-être pas nul.
ga: B’fhéidir nach bhfuil an fhormáid sprice nialasach
hi: लक्ष्य प्रारूप शून्य नहीं हो सकता
hi_latn: lakshy praaroop shoony nahin ho sakata
id: Format target mungkin tidak null
it: Il formato di destinazione non può essere nullo
ja: ターゲット形式は null であってはなりません。
ko: 대상 형식이 null일 수 없습니다.
nb: Målformatet kan ikke være null
nl: De doelopmaak mag niet nul zijn
pt: O formato de destino não pode ser nulo
ro: Formatul țintă poate să nu fie nul
uk: Цільовий формат може бути не нульовим
zh: 目標格式不能為空

# TEXTIFY_GENERAL_EXCEPTION_TARGETVARSARENULL
source: The target vars may not be null
ar: لا يجوز أن تكون متغيرات الهدف فارغة.
de: Die Zielvariablen dürfen nicht null sein.
el: Οι μεταβλητές στόχου ενδέχεται να μην είναι null
fr: Les variables cibles n'ont peut-être pas nulles.
ga: B’fhéidir nach bhfuil na hathróga sprice nialasach
hi: लक्ष्य चर शून्य नहीं हो सकता
hi_latn: lakshy char shoony nahin ho sakata
id: Variabel target mungkin tidak null
it: Le variabili di destinazione non possono essere nulle
ja: ターゲット変数は null であってはなりません。
ko: 대상 변수가 null일 수 없습니다.
nb: Målvariablene kan ikke være null
nl: De doelvariabelen mogen niet nul zijn
pt: As variáveis ​​alvo não podem ser nulas
ro: Variabilele țintă pot să nu fie nule
uk: Цільові змінні можуть бути не нульовими
zh: 目標變數不能為空

# TEXTIFY_GENERAL_EXCEPTION_TARGETEXPRESSIONISNULL
source: The target expression may not be null
ar: لا يجوز أن يكون تعبير الهدف فارغًا.
de: Der Zielausdruck darf nicht null sein.
el: Η έκφραση στόχου ενδέχεται να μην είναι null
fr: L'expression cible ne doit pas être nulle
ga: B’fhéidir nach bhfuil an abairt sprice nialasach
hi: लक्ष्य अभिव्यक्ति शून्य नहीं हो सकती
hi_latn: lakshy abhivyakti shoony nahin ho sakatee
id: Ekspresi target mungkin tidak null
it: L'espressione di destinazione non può essere nulla
ja: ターゲット式は null であってはなりません。
ko: 대상 표현식이 null일 수 없습니다.
nb: Måluttrykket kan ikke være null
nl: De doelexpressie mag niet nul zijn
pt: A expressão de destino não pode ser nula
ro: Expresia țintă poate să nu fie nulă
uk: Цільовий вираз може бути не нульовим
zh: 目標表達式不能為空

# TEXTIFY_GENERAL_EXCEPTION_LRPSTEPSINVALID
source: Can't get the letter repetition pattern with zero or negative number of steps.
ar: لا يمكن الحصول على نمط تكرار الحرف مع عدد خطوات صفري أو سالب.
de: Das Buchstabenwiederholungsmuster kann nicht mit null oder einer negativen Schrittzahl abgerufen werden.
el: Δεν είναι δυνατή η λήψη του μοτίβου επανάληψης γραμμάτων με μηδέν ή αρνητικό αριθμό βημάτων.
fr: Impossible d'obtenir le modèle de répétition de lettres avec un nombre d'étapes nul ou négatif.
ga: Ní féidir an patrún athrá litreacha a fháil le líon céimeanna nialasach nó diúltach.
hi: शून्य या ऋणात्मक संख्या के चरणों के साथ अक्षर पुनरावृत्ति पैटर्न प्राप्त नहीं किया जा सकता।
hi_latn: shoony ya rnaatmak sankhya ke charanon ke saath akshar punaraavrtti paitarn praapt nahin kiya ja sakata.
id: Tidak dapat memperoleh pola pengulangan huruf dengan jumlah langkah nol atau negatif.
it: Impossibile ottenere il modello di ripetizione delle lettere con un numero di passi pari a zero o negativo.
ja: ステップ数が 0 または負の数の文字繰り返しパターンを取得できません。
ko: 0 또는 음수 단계의 문자 반복 패턴을 가져올 수 없습니다.
nb: Kan ikke hente bokstavrepetisjonsmønsteret med null eller negativt antall trinn.
nl: Kan het letterherhalingspatroon met nul of een negatief aantal stappen niet ophalen.
pt: Não é possível obter o padrão de repetição de letras com zero ou número negativo de passos.
ro: Nu se poate obține modelul de repetiție a literelor cu zero sau un număr negativ de pași.
uk: Неможливо отримати шаблон повторення літер з нульовою або від'ємною кількістю кроків.
zh: 無法取得步長為零或負數的字母重複模式。

# TEXTIFY_GENERAL_EXCEPTION_OFFSETOUTOFRANGE
source: Offset is out of range
ar: الإزاحة خارج النطاق.
de: Offset liegt außerhalb des gültigen Bereichs.
el: Η μετατόπιση είναι εκτός εύρους
fr: Le décalage est hors limites
ga: Tá an fhritháireamh lasmuigh den raon
hi: ऑफसेट सीमा से बाहर है
hi_latn: ophaset seema se baahar hai
id: Offset berada di luar rentang
it: L'offset è fuori intervallo
ja: オフセットが範囲外です。
ko: 오프셋이 범위를 벗어났습니다.
nb: Forskyvningen er utenfor rekkevidde
nl: Offset valt buiten bereik
pt: Deslocamento fora do intervalo
ro: Offset-ul este în afara intervalului
uk: Зсув поза діапазоном
zh: 偏移量超出範圍

# TEXTIFY_GENERAL_EXCEPTION_CHARNUMINVALID
source: Invalid character number {0}.
ar: رقم الحرف غير صالح {0}.
de: Ungültige Zeichennummer {0}.
el: Μη έγκυρος αριθμός χαρακτήρων {0}.
fr: Numéro de caractère non valide {0}.
ga: Uimhir charachtair neamhbhailí {0}.
hi: अमान्य वर्ण संख्या {0}।
hi_latn: amaany varn sankhya {0}.
id: Nomor karakter tidak valid {0}.
it: Numero di caratteri non valido {0}.
ja: 文字番号 {0} が無効です。
ko: 잘못된 문자 번호 {0}입니다.
nb: Ugyldig tegnnummer {0}.
nl: Ongeldig tekennummer {0}.
pt: Número de caracteres inválido {0}.
ro: Număr de caractere nevalid {0}.
uk: Недійсний номер символу {0}.
zh: 字元數 {0} 無效。
