Repository: Aptivi/Textify
Catalog: public/Textify/Resources/Languages/Output/Localizations.*.resx
Languages: ar, de, el, fr, ga, hi, hi_latn, id, it, ja, ko, nb, nl, pt, ro, uk, zh

# TEXTIFY_GENERAL_EXCEPTION_COMPARISONINVALID_NOCASE
source: Comparison {0} not valid for case-insensitive string comparison
ar: المقارنة {0} غير صالحة لمقارنة سلاسل نصية غير حساسة لحالة الأحرف.
de: Vergleich {0} ungültig für Groß- und Kleinschreibung.
el: Η σύγκριση {0} δεν είναι έγκυρη για σύγκριση συμβολοσειρών χωρίς διάκριση πεζών-κεφαλαίων
fr: Comparaison {0} non valide pour une comparaison de chaînes insensible à la casse
ga: Níl an chomparáid {0} bailí le haghaidh comparáid teaghrán neamhíogair ó thaobh cás de
hi: केस-असंवेदनशील स्ट्रिंग तुलना के लिए तुलना {0} मान्य नहीं है
hi_latn: kes-asanvedanasheel string tulana ke lie tulana {0} maany nahin hai
id: Perbandingan {0} tidak valid untuk perbandingan string yang tidak peka huruf besar/kecil
it: Il confronto {0} non è valido per il confronto di stringhe senza distinzione tra maiuscole e minuscole
ja: 大文字と小文字を区別しない文字列比較では、比較 {0} は無効です。
ko: 비교 {0}은(는) 대소문자를 구분하지 않는 문자열 비교에 유효하지 않습니다.
nb: Sammenligning {0} er ikke gyldig for sammenligning av store og små bokstaver
nl: Vergelijking {0} is niet geldig voor hoofdlettergevoelige tekenreeksvergelijking
pt: A comparação {0} não é válida para a comparação de strings sem diferenciação entre maiúsculas e minúsculas
ro: Comparația {0} nu este validă pentru compararea șirurilor fără a ține cont de majuscule/minuscule
uk: Порівняння {0} недійсне для порівняння рядків без урахування регістру
zh: 比較 {0} 對於不區分大小寫的字串比較無效

# TEXTIFY_GENERAL_EXCEPTION_COMPARISONINVALID_CASE
source: Comparison {0} not valid for case-sensitive string comparison
ar: المقارنة {0} غير صالحة لمقارنة سلاسل نصية حساسة لحالة الأحرف.
de: Vergleich {0} ungültig für Groß- und Kleinschreibung.
el: Η σύγκριση {0} δεν είναι έγκυρη για σύγκριση συμβολοσειρών με διάκριση πεζών-κεφαλαίων
fr: Comparaison {0} non valide pour une comparaison de chaînes sensible à la casse
ga: Níl an chomparáid {0} bailí le haghaidh comparáid teaghrán íogair ó thaobh cás de
hi: केस-संवेदनशील स्ट्रिंग तुलना के लिए तुलना {0} मान्य नहीं है
hi_latn: kes-sanvedanasheel string tulana ke lie tulana {0} maany nahin hai
id: Perbandingan {0} tidak valid untuk perbandingan string yang peka huruf besar/kecil
it: Il confronto {0} non è valido per il confronto di stringhe con distinzione tra maiuscole e minuscole
ja: 大文字と小文字を区別する文字列比較では、比較 {0} は無効です。
ko: 비교 {0}은(는) 대소문자를 구분하는 문자열 비교에 유효하지 않습니다.
nb: Sammenligning {0} er ikke gyldig for sammenligning av store og små bokstaver
nl: Vergelijking {0} is niet geldig voor hoofdlettergevoelige tekenreeksvergelijking
pt: A comparação {0} não é válida para a comparação de strings com diferenciação entre maiúsculas e minúsculas
ro: Comparația {0} nu este validă pentru compararea șirurilor cu țintă de majuscule/minuscule
uk: Порівняння {0} недійсне для порівняння рядків з урахуванням регістру
zh: 比較 {0} 對於區分大小寫的字串比較無效

# TEXTIFY_GENERAL_EXCEPTION_IDXNEGATIVE
source: Specified index [{0}] may not be less than zero
ar: لا يجوز أن يكون الفهرس المحدد [{0}] أقل من الصفر.
de: Der angegebene Index [{0}] darf nicht kleiner als null sein.
el: Ο καθορισμένος δείκτης [{0}] δεν μπορεί να είναι μικρότερος από μηδέν
fr: L'index spécifié [{0}] ne doit pas être inférieur à zéro
ga: Ní fhéadfaidh an t-innéacs sonraithe [{0}] a bheith níos lú ná nialas
hi: निर्दिष्ट सूचकांक [{0}] शून्य से कम नहीं हो सकता
hi_latn: nirdisht soochakaank [{0}] shoony se kam nahin ho sakata
id: Indeks yang ditentukan [{0}] tidak boleh kurang dari nol
it: L'indice specificato [{0}] non può essere minore di zero
ja: 指定されたインデックス [{0}] は 0 未満であってはなりません。
ko: 지정된 인덱스 [{0}]은(는) 0보다 작을 수 없습니다.
nb: Angitt indeks [{0}] kan ikke være mindre enn null
nl: De opgegeven index [{0}] mag niet kleiner zijn dan nul
pt: O índice especificado [{0}] não pode ser inferior a zero
ro: Indicele specificat [{0}] nu poate fi mai mic decât zero
uk: Вказаний індекс [{0}] не може бути меншим за нуль
zh: 指定的索引 [{0}] 不能小於零

# TEXTIFY_GENERAL_EXCEPTION_IDXOUTOFRANGE
source: Specified index [{0}] may not be larger than the source string length [{1}]
ar: لا يجوز أن يكون الفهرس المحدد [{0}] أكبر من طول سلسلة النص المصدر [{1}].
de: Der angegebene Index [{0}] darf nicht größer als die Länge des Quellstrings [{1}] sein.
el: Ο καθορισμένος δείκτης [{0}] δεν μπορεί να είναι μεγαλύτερος από το μήκος της συμβολοσειράς πηγής [{1}]
fr: L'index spécifié [{0}] ne doit pas être supérieur à la longueur de la chaîne source [{1}]
ga: Ní fhéadfaidh an t-innéacs sonraithe [{0}] a bheith níos mó ná fad an teaghráin foinse [{1}]
hi: निर्दिष्ट सूचकांक [{0}] स्रोत स्ट्रिंग लंबाई [{1}] से बड़ा नहीं हो सकता
hi_latn: nirdisht soochakaank [{0}] srot string lambaee [{1}] se bada nahin ho sakata
id: Indeks yang ditentukan [{0}] tidak boleh lebih besar dari panjang string sumber [{1}]
it: L'indice specificato [{0}] non può essere maggiore della lunghezza della stringa di origine [{1}]
ja: 指定されたインデックス [{0}] は、ソース文字列の長さ [{1}] より大きくあってはなりません。
ko: 지정된 인덱스 [{0}]은(는) 소스 문자열 길이 [{1}]보다 클 수 없습니다.
nb: Angitt indeks [{0}] kan ikke være større enn kildestrengens lengde [{1}]
nl: De opgegeven index [{0}] mag niet groter zijn dan de lengte van de brontekenreeks [{1}]
pt: O índice especificado [{0}] não pode ser maior que o comprimento da string de origem [{1}]
ro: Indicele specificat [{0}] nu poate fi mai mare decât lungimea șirului sursă [{1}]
uk: Вказаний індекс [{0}] не може бути більшим за довжину вихідного рядка [{1}]
zh: 指定的索引 [{0}] 不能大於來源字串的長度 [{1}]

# TEXTIFY_GENERAL_EXCEPTION_NEEDSSURROGATES
source: To break surrogates, there needs to be two valid surrogate characters.
ar: لفصل البدائل، يجب وجود حرفين بديلين صالحين.
de: Um Surrogate zu unterbrechen, sind zwei gültige Surrogatzeichen erforderlich.
el: Για να διασπαστούν τα υποκατάστατα, πρέπει να υπάρχουν δύο έγκυροι χαρακτήρες υποκατάστασης.
fr: Pour rompre les substitutions, deux caractères de substitution valides sont nécessaires.
ga: Chun ionadaithe a bhriseadh, ní mór dhá charachtar ionadaithe bailí a bheith ann.
hi: सरोगेट को तोड़ने के लिए, दो वैध सरोगेट वर्ण होने चाहिए।
hi_latn: saroget ko todane ke lie, do vaidh saroget varn hone chaahie.
id: Untuk memecah pengganti, perlu ada dua karakter pengganti yang valid.
it: Per interrompere i surrogati, è necessario che vi siano due caratteri surrogati validi.
ja: サロゲートを分割するには、有効なサロゲート文字が 2 つ必要です。
ko: 서로게이트를 분리하려면 두 개의 유효한 서로게이트 문자가 있어야 합니다.
nb: For å bryte surrogater må det være to gyldige surrogattegn.
nl: Om surrogaten te verbreken, moeten er twee geldige surrogaattekens zijn.
pt: Para quebrar os substitutos, é necessário que existam dois caracteres substitutos válidos.
ro: Pentru a sparge surogate-urile, trebuie să existe două caractere surogate valide.
uk: Щоб розірвати сурогати, необхідно два дійсних сурогатних символи.
zh: 要斷開代理項，需要有兩個有效的代理項字元。

# TEXTIFY_GENERAL_EXCEPTION_SURROGATESINVALID
source: The source string is not a valid surrogate pair.
ar: سلسلة النص المصدر ليست زوجًا بديلًا صالحًا.
de: Der Quellstring ist kein gültiges Surrogatpaar.
el: Η συμβολοσειρά πηγής δεν είναι έγκυρο ζεύγος υποκατάστατων.
fr: La chaîne source n'est pas une paire de substitution valide.
ga: Ní péire ionadaithe bailí é an teaghrán foinse.
hi: स्रोत स्ट्रिंग एक वैध सरोगेट जोड़ी नहीं है।
hi_latn: srot string ek vaidh saroget jodee nahin hai.
id: String sumber bukan pasangan pengganti yang valid.
it: La stringa di origine non è una coppia di surrogati valida.
ja: ソース文字列は有効なサロゲートペアではありません。
ko: 소스 문자열이 유효한 서로게이트 쌍이 아닙니다.
nb: Kildestrengen er ikke et gyldig surrogatpar.
nl: De brontekenreeks is geen geldig surrogaatpaar.
pt: A string de origem não é um par substituto válido.
ro: Șirul sursă nu este o pereche de surogate validă.
uk: Вихідний рядок не є дійсною парою сурогатів.
zh: 來源字串不是有效的代理項對。

# TEXTIFY_SPACEMAN_ANALYSIS_EXCEPTION_FILENOTFOUND
source: File not found to analyze space from.
ar: لم يتم العثور على ملف لتحليل المساحة منه.
de: Datei zur Analyse des Speicherplatzes nicht gefunden.
el: Δεν βρέθηκε αρχείο για ανάλυση χώρου.
fr: Fichier introuvable pour l'analyse de l'espace.
ga: Níor aimsíodh comhad chun spás a anailísiú uaidh.
hi: स्पेस का विश्लेषण करने के लिए फ़ाइल नहीं मिली।
hi_latn: spes ka vishleshan karane ke lie fail nahin milee.
id: File tidak ditemukan untuk menganalisis spasi.
it: File non trovato da cui analizzare lo spazio.
ja: スペースを分析するファイルが見つかりません。
ko: 공백을 분석할 파일을 찾을 수 없습니다.
nb: Filen ble ikke funnet for å analysere mellomrom fra.
nl: Bestand niet gevonden om de ruimte van te analyseren.
pt: Ficheiro não encontrado para analisar o espaço.
ro: Fișierul nu a fost găsit pentru a analiza spațiul.
uk: Файл не знайдено для аналізу пробілу.
zh: 未找到用於分析空間的檔案。

# TEXTIFY_SPACEMAN_ANALYSIS_EXCEPTION_STREAMUNREADABLE
source: Stream can't read.
ar: لا يمكن للتيار القراءة.
de: Stream kann nicht lesen.
el: Η ροή δεν μπορεί να διαβάσει.
fr: Le flux ne peut pas être lu.
ga: Ní féidir leis an sruth léamh.
hi: स्ट्रीम नहीं पढ़ी जा सकती।
hi_latn: streem nahin padhee ja sakatee.
id: Aliran tidak dapat membaca.
it: Impossibile leggere il flusso.
ja: ストリームは読み取りできません。
ko: 스트림에서 읽을 수 없습니다.
nb: Strømmen kan ikke lese.
nl: Stream kan niet lezen.
pt: O fluxo não consegue ler.
ro: Fluxul nu poate fi citit.
uk: Потік не може читати.
zh: 流無法讀取。

# TEXTIFY_SPACEMAN_ANALYSIS_EXCEPTION_STREAMUNSEEKABLE
source: Stream can't seek.
ar: لا يمكن للتيار البحث.
de: Stream kann nicht suchen.
el: Η ροή δεν μπορεί να αναζητήσει.
fr: Le flux ne peut pas être recherché.
ga: Ní féidir leis an sruth cuardach.
hi: स्ट्रीम नहीं खोज सकती।
hi_latn: streem nahin khoj sakatee.
id: Aliran tidak dapat mencari.
it: Impossibile cercare il flusso.
ja: ストリームはシークできません。
ko: 스트림에서 검색할 수 없습니다.
nb: Strømmen kan ikke søke.
nl: Stream kan niet zoeken.
pt: O fluxo não pode procurar.
ro: Fluxul nu poate fi căutat.
uk: Потік не може шукати.
zh: 流無法定位。

# TEXTIFY_TOOLS_PLACES_EXCEPTION_PARSEERROR
source: Error trying to parse placeholders. {0}
ar: خطأ في محاولة تحليل العناصر النائبة. {0}
de: Fehler beim Parsen der Platzhalter. {0}
el: Σφάλμα κατά την προσπάθεια ανάλυσης placeholders. {0}
fr: Erreur lors de l'analyse des espaces réservés. {0}
ga: Earráid ag iarraidh áitshealbhóirí a pharsáil. {0}
hi: प्लेसहोल्डर को पार्स करने का प्रयास करते समय त्रुटि। {0}
hi_latn: plesaholdar ko paars karane ka prayaas karate samay truti. {0}
id: Terjadi kesalahan saat mencoba mengurai placeholder. {0}
it: Errore durante l'analisi dei segnaposto. {0}
ja: プレースホルダーの解析中にエラーが発生しました。 {0}
ko: 자리 표시자를 구문 분석하는 중 오류가 발생했습니다. {0}
nb: Feil ved forsøk på å analysere plassholdere. {0}
nl: Fout bij het parseren van tijdelijke aanduidingen. {0}
pt: Erro ao tentar analisar os marcadores de posição. {0}
ro: Eroare la încercarea de a analiza substituenții. {0}
uk: Помилка спроби розбору заповнювачів. {0}
zh: 嘗試解析佔位符時出錯。 {0}

# TEXTIFY_TOOLS_PLACES_EXCEPTION_PLACENULL
source: Placeholder may not be null
ar: لا يجوز أن يكون العنصر النائب فارغًا
de: Platzhalter darf nicht null sein.
el: Το σύμβολο κράτησης θέσης δεν μπορεί να είναι null
fr: L'espace réservé ne peut pas être nul
ga: Ní fhéadfaidh an áitchoimeádaí a bheith neamhní
hi: प्लेसहोल्डर शून्य नहीं हो सकता
hi_latn: plesaholdar shoony nahin ho sakata
id: Placeholder tidak boleh null
it: Il segnaposto non può essere nullo
ja: プレースホルダは null にできません
ko: 자리 표시자는 null일 수 없습니다.
nb: Plassholderen kan ikke være null
nl: Tijdelijke aanduiding mag niet nul zijn
pt: O espaço reservado não pode ser nulo
ro: Substituentul poate să nu fie nul
uk: Заповнювач не може бути null
zh: 佔位符不能為空

# TEXTIFY_TOOLS_PLACES_EXCEPTION_PLACEACTIONNULL
source: Placeholder action may not be null
ar: لا يجوز أن يكون إجراء العنصر النائب فارغًا
de: Platzhalteraktion darf nicht null sein.
el: Η ενέργεια του συμβόλου κράτησης θέσης δεν μπορεί να είναι null
fr: L'action de l'espace réservé ne peut pas être nulle
ga: Ní fhéadfaidh gníomh an áitchoimeádaí a bheith neamhní
hi: प्लेसहोल्डर क्रिया शून्य नहीं हो सकती
hi_latn: plesaholdar kriya shoony nahin ho sakatee
id: Tindakan placeholder tidak boleh null
it: L'azione del segnaposto non può essere nullo
ja: プレースホルダアクションは null にできません
ko: 자리 표시자 작업은 null일 수 없습니다.
nb: Plassholderhandlingen kan ikke være null
nl: Tijdelijke aanduidingactie mag niet nul zijn
pt: A ação do espaço reservado não pode ser nula
ro: Acțiunea substituentului poate să nu fie nulă
uk: Дія заповнювача не може бути null
zh: 佔位符操作不能為空

# TEXTIFY_TOOLS_PLACES_EXCEPTION_PLACENOTFOUND
source: Placeholder is not registered
ar: العنصر النائب غير مسجل
de: Platzhalter ist nicht registriert.
el: Το σύμβολο κράτησης θέσης δεν είναι καταχωρημένο
fr: L'espace réservé n'est pas enregistré
ga: Níl an áitchoimeádaí cláraithe
hi: प्लेसहोल्डर पंजीकृत नहीं है
hi_latn: plesaholdar panjeekrt nahin hai
id: Placeholder tidak terdaftar
it: Il segnaposto non è registrato
ja: プレースホルダが登録されていません
ko: 자리 표시자가 등록되지 않았습니다.
nb: Plassholderen er ikke registrert
nl: Tijdelijke aanduiding is niet geregistreerd
pt: O espaço reservado não está registado
ro: Substituentul nu este înregistrat
uk: Заповнювач не зареєстровано
zh: 佔位符未註冊

# TEXTIFY_TOOLS_PLACES_EXCEPTION_PLACEFORMATERROR
source: Placeholder must satisfy this format
ar: يجب أن يتوافق العنصر النائب مع هذا التنسيق
de: Platzhalter muss diesem Format entsprechen.
el: Το σύμβολο κράτησης θέσης πρέπει να ικανοποιεί αυτήν τη μορφή
fr: L'espace réservé doit respecter ce format
ga: Ní mór don áitchoimeádaí an fhormáid seo a chomhlíonadh
hi: प्लेसहोल्डर को इस प्रारूप को पूरा करना होगा
hi_latn: plesaholdar ko is praaroop ko poora karana hoga
id: Placeholder harus memenuhi format ini
it: Il segnaposto deve soddisfare questo formato
ja: プレースホルダはこの形式を満たす必要があります
ko: 자리 표시자는 다음 형식을 충족해야 합니다.
nb: Plassholderen må oppfylle dette formatet
nl: Tijdelijke aanduiding moet voldoen aan deze indeling
pt: O espaço reservado deve atender a este formato
ro: Substituentul trebuie să îndeplinească acest format
uk: Заповнювач має відповідати цьому формату
zh: 佔位符必須滿足此格式

# TEXTIFY_TOOLS_REGEX_EXCEPTION_INVALIDREGEXPATTERN
source: Regular expression pattern is invalid.
ar: نمط التعبيرات العادية غير صالح.
de: Das Muster des regulären Ausdrucks ist ungültig.
el: Το μοτίβο κανονικής έκφρασης δεν είναι έγκυρο.
fr: Le modèle d'expression régulière n'est pas valide.
ga: Tá patrún na rialtachta neamhbhailí.
hi: नियमित अभिव्यक्ति पैटर्न अमान्य है।
hi_latn: niyamit abhivyakti paitarn amaany hai.
id: Pola ekspresi reguler tidak valid.
it: Il modello di espressione regolare non è valido.
ja: 正規表現パターンが無効です
ko: 정규 표현식 패턴이 잘못되었습니다.
nb: Regularuttrykksmønsteret er ugyldig.
nl: Reguliere-expressiepatroon is ongeldig.
pt: O padrão de expressão regular é inválido.
ro: Modelul expresiei regulate este invalid.
uk: Шаблон регулярного виразу недійсний.
zh: 正規表示式模式無效。

# TEXTIFY_TOOLS_REGEX_EXCEPTION_INVALIDREGEXSYNTAX
source: Invalid regular expression syntax.
ar: بنية تعبير عادي غير صالحة.
de: Ungültige Syntax des regulären Ausdrucks.
el: Μη έγκυρη σύνταξη κανονικής έκφρασης.
fr: La syntaxe de l'expression régulière est invalide.
ga: Comhréir neamhbhailí na rialtachta.
hi: अमान्य नियमित अभिव्यक्ति सिंटैक्स।
hi_latn: amaany niyamit abhivyakti sintaiks.
id: Sintaks ekspresi reguler tidak valid.
it: Sintassi dell'espressione regolare non valida.
ja: 正規表現の構文が無効です
ko: 정규 표현식 구문이 잘못되었습니다.
nb: Ugyldig syntaks for regularuttrykk.
nl: Ongeldige syntaxis van reguliere expressie.
pt: Sintaxe de expressão regular inválida.
ro: Sintaxa expresiei regulate invalidă.
uk: Недійсний синтаксис регулярного виразу.
zh: 正規表示式語法無效。

# TEXTIFY_VERSIONING_EXCEPTION_INVALIDPART_MAJOR
source: Invalid major version part
ar: جزء إصدار رئيسي غير صالح
de: Ungültiger Hauptversionsteil.
el: Μη έγκυρο κύριο μέρος έκδοσης
fr: Partie de version majeure invalide
ga: Cuid mhórleagan neamhbhailí
hi: अमान्य प्रमुख संस्करण भाग
hi_latn: amaany pramukh sanskaran bhaag
id: Bagian versi mayor tidak valid
it: Parte della versione principale non valida
ja: メジャーバージョン部分が無効です
ko: 주 버전 부분이 잘못되었습니다.
nb: Ugyldig hovedversjonsdel
nl: Ongeldig hoofdversiedeel
pt: Parte da versão principal inválida
ro: Parte a versiunii majore invalidă
uk: Недійсна частина основної версії
zh: 主版本號碼部分無效

# TEXTIFY_VERSIONING_EXCEPTION_INVALIDPART_MINOR
source: Invalid minor version part
ar: جزء إصدار ثانوي غير صالح
de: Ungültiger Nebenversionsteil.
el: Μη έγκυρο δευτερεύον μέρος έκδοσης
fr: Partie de version mineure invalide
ga: Cuid mionleagan neamhbhailí
hi: अमान्य लघु संस्करण भाग
hi_latn: amaany laghu sanskaran bhaag
id: Bagian versi minor tidak valid
it: Parte della versione secondaria non valida
ja: マイナーバージョン部分が無効です
ko: 부 버전 부분이 잘못되었습니다.
nb: Ugyldig underversjonsdel
nl: Ongeldig subversiedeel
pt: Parte da versão secundária inválida
ro: Parte a versiunii minore invalidă
uk: Недійсна частина проміжної версії
zh: 次版本號部分無效

# TEXTIFY_VERSIONING_EXCEPTION_INVALIDPART_PATCH
source: Invalid patch version part
ar: جزء إصدار تصحيح غير صالح
de: Ungültiger Patchversionsteil.
el: Μη έγκυρο μέρος έκδοσης ενημέρωσης κώδικα
fr: Partie de version de correctif invalide
ga: Cuid leagan paiste neamhbhailí
hi: अमान्य पैच संस्करण भाग
hi_latn: amaany paich sanskaran bhaag
id: Bagian versi patch tidak valid
it: Parte della versione della patch non valida
ja: パッチバージョン部分が無効です
ko: 패치 버전 부분이 잘못되었습니다.
nb: Ugyldig oppdateringsversjonsdel
nl: Ongeldig patchversiedeel
pt: Parte da versão do patch inválida
ro: Parte a versiunii de patch invalidă
uk: Недійсна частина версії виправлення
zh: 補丁版本號部分無效

# TEXTIFY_VERSIONING_EXCEPTION_INVALIDPART_REVISION
source: Invalid revision version part
ar: جزء إصدار مراجعة غير صالح
de: Ungültiger Revisionsversionsteil.
el: Μη έγκυρο μέρος έκδοσης αναθεώρησης
fr: Partie de version de révision invalide
ga: Cuid leagan athbhreithnithe neamhbhailí
hi: अमान्य संशोधन संस्करण भाग
hi_latn: amaany sanshodhan sanskaran bhaag
id: Bagian versi revisi tidak valid
it: Parte della versione della revisione non valida
ja: リビジョンバージョン部分が無効です
ko: 수정 버전 부분이 잘못되었습니다.
nb: Ugyldig revisjonsversjonsdel
nl: Ongeldig revisieversiedeel
pt: Parte da versão da revisão inválida
ro: Parte a versiunii de revizie invalidă
uk: Недійсна частина версії редакції
zh: 修訂版本號碼部分無效

# TEXTIFY_VERSIONING_EXCEPTION_INVALIDSEMVERSTRING
source: This version [{0}] is not a valid SemVer string.
ar: هذا الإصدار [{0}] ليس سلسلة SemVer صالحة.
de: Diese Version [{0}] ist kein gültiger SemVer-String.
el: Αυτή η έκδοση [{0}] δεν είναι έγκυρη συμβολοσειρά SemVer.
fr: Cette version [{0}] n'est pas une chaîne SemVer valide.
ga: Ní teaghrán bailí SemVer é an leagan seo [{0}].
hi: यह संस्करण [{0}] एक मान्य SemVer स्ट्रिंग नहीं है।
hi_latn: yah sanskaran [{0}] ek maany saimvair string nahin hai.
id: Versi ini [{0}] bukan string SemVer yang valid.
it: Questa versione [{0}] non è una stringa SemVer valida.
ja: このバージョン [{0}] は有効な SemVer 文字列ではありません。
ko: 이 버전 [{0}]은(는) 유효한 SemVer 문자열이 아닙니다.
nb: Denne versjonen [{0}] er ikke en gyldig SemVer-streng.
nl: Deze versie [{0}] is geen geldige SemVer-tekenreeks.
pt: Esta versão [{0}] não é uma string SemVer válida.
ro: Această versiune [{0}] nu este un șir SemVer valid.
uk: Ця версія [{0}] не є дійсним рядком SemVer.
zh: 此版本 [{0}] 不是有效的 SemVer 字串。
